app/controllers/sms_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`mobile` = '93f57323e0205dffea729add44cb702b' LIMIT 1
INSERT INTO `users` (`created_at`, `crypted_password`, `mobile`, `password_salt`, `perishable_token`, `persistence_token`, `updated_at`) VALUES ('2012-10-19 18:06:35', '14e5119cc8fc75ef121c98fcef38731d1a18d835ec844cfabfd2032a3913b03ff4044527b997e162e046b78b746c63129f21676fcf17b59f5f89f5e22384d5ed', '93f57323e0205dffea729add44cb702b', 'RQk0TZrOYNCeA5JgBPV', 'bQhdXjKPkhn7CBW7HwI', '6c94e1a726e0569b5cc4fd9f3cac1431aad2e4cd1e5220d576b0c867693a398c72bc32174b45376c1685666ea109b6509c4596cd686e201e6fc4181425282faa', '2012-10-19 18:06:35')
SELECT 1 AS one FROM `users` WHERE `users`.`mobile` = '93f57323e0205dffea729add44cb702b' LIMIT 1
---
  def main
    @msg=params[:message]
    @mobile_number=params[:mobile]
    @splitted_msg=@msg.split(/\W+/)
    case @splitted_msg[0].downcase
    when "register"
        pass=rand(100000.999999)
        @user=User.find_by_mobile(params[:mobile])||User.new
        if @user.new_record?
        @user.mobile=params[:mobile]
        @user.password=pass
        @user.password_confirmation=pass
        @user.save
        @message="your password is #{pass}"
        else
         @message="already registered"

        end
    when "send"
        @sms=Sms.new
        @sms.from_mobile=params[:mobile]
        @sms.to_mobile=Digest::MD5.hexdigest(@splitted_msg[1])
#        Digest::MD5.hexdigest('foobar')
        @sms.message=@splitted_msg.last(@splitted_msg.count-2).join(" ")
        @sms.save
    when "snd"
        @sender=User.find_by_mobile(params[:mobile])
        if @sender.present?