app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `mobile`, `password_salt`, `perishable_token`, `persistence_token`, `updated_at`) VALUES ('2012-10-16 19:02:30', '8b199b1971278c92bf5d8474bda87d9f966f8e9bd3be86852195cb7f90cf1ef634f5d9fc8499c216d257acc5fba553fbf9a9fb1b8f405dce32041a2f81a31b87', '7293313878', 'vK3J1Bod7kJsbvKRYRJ', 'ihDgwTpnO53lwTYxYZBO', 'cab2fbcfc77cfbfa2893dbdd4faa393b7e06739820caf2851acf0d4ea8172ccaffe0cdb93fa11ec3e5b40636af2ec48b9c805e36395269f6759b244b739e0b27', '2012-10-16 19:02:30')
---
  def create
    @user = User.new(params[:user])
    @user.mobile= Digest::MD5.hexdigest(params[:user][:mobile])
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def show
    @user=User.find(params[:id])